; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 box ball - object_
 )
 (:constants
   empty - empty_0
   room_2 - room
   blue_ball_3 - ball
   green_door_1 - door
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)) (not (or (= ?room2 room_2) (and (agentinroom room_2) (not (= ?room1 room_2))))))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (hold_0) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (when (or (and (= ?obj blue_ball_3) (= ?room room_2)) (objectinroom blue_ball_3 room_2)) (hold_0)) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door) (or (and (not (locked ?door)) (= ?door green_door_1)) (and (locked green_door_1) (not (and (locked ?door) (= ?door green_door_1))))))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_1 room_3 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   yellow_door_1 green_door_2 red_door_1 - door
   purple_box_2 green_box_1 purple_box_1 grey_box_1 - box
   blue_ball_1 blue_ball_2 red_ball_1 - ball
 )
 (:init (agentinroom room_4) (objectinroom purple_box_1 room_1) (objectinroom blue_ball_1 room_1) (objectinroom purple_box_2 room_1) (objectinroom blue_ball_2 room_2) (objectinroom red_ball_1 room_2) (objectinroom green_box_1 room_2) (objectinroom blue_ball_3 room_3) (objectinroom grey_box_1 room_4) (objectcolor purple_box_1 purpletype) (objectcolor blue_ball_1 bluetype) (objectcolor purple_box_2 purpletype) (objectcolor blue_ball_2 bluetype) (objectcolor red_ball_1 redtype) (objectcolor green_box_1 greentype) (objectcolor blue_ball_3 bluetype) (objectcolor grey_box_1 greytype) (objectcolor green_door_1 greentype) (objectcolor yellow_door_1 yellowtype) (objectcolor green_door_2 greentype) (objectcolor red_door_1 redtype) (emptyhands) (locked green_door_1) (locked yellow_door_1) (locked green_door_2) (locked red_door_1) (adjacentrooms room_2 room_1 green_door_1) (adjacentrooms room_1 room_2 green_door_1) (adjacentrooms room_3 room_1 yellow_door_1) (adjacentrooms room_1 room_3 yellow_door_1) (adjacentrooms room_4 room_2 green_door_2) (adjacentrooms room_2 room_4 green_door_2) (adjacentrooms room_4 room_3 red_door_1) (adjacentrooms room_3 room_4 red_door_1) (visited room_4) (= (total-cost) 0))
 (:goal (and (exists (?v - box)
 (and (objectcolor ?v purpletype) (objectinroom ?v room_1) (agentinroom room_1) (at_ ?v))) (hold_0)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor red_door_1 room_4 room_3)
   added: (at_ red_door_1)
   goals met: 0 of 2
2. (toggle red_door_1)
   deleted: (locked red_door_1)
   goals met: 0 of 2
3. (gotoroom room_4 room_3 red_door_1)
   deleted: (agentinroom room_4) (at_ red_door_1)
   added: (agentinroom room_3) (visited room_3)
   goals met: 0 of 2
4. (gotodoor yellow_door_1 room_3 room_1)
   added: (at_ yellow_door_1)
   goals met: 0 of 2
5. (toggle yellow_door_1)
   deleted: (locked yellow_door_1)
   goals met: 0 of 2
6. (gotoobject blue_ball_3 room_3)
   deleted: (at_ yellow_door_1)
   added: (at_ blue_ball_3)
   goals met: 0 of 2
7. (pick blue_ball_3 room_3)
   deleted: (at_ blue_ball_3) (emptyhands) (objectinroom blue_ball_3 room_3)
   added: (carrying blue_ball_3) (hold_0)
   goals met: 1 of 2
8. (gotoroom room_3 room_1 yellow_door_1)
   deleted: (agentinroom room_3)
   added: (agentinroom room_1) (visited room_1)
   goals met: 1 of 2
9. (gotoobject purple_box_1 room_1)
   added: (at_ purple_box_1)
   goals met: 2 of 2
